<a href="https://colab.research.google.com/github/haradats/pandasNotebook/blob/main/pandasNote01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Seriesの作成

## リストからSeriesを作成する

In [ ]:
lst1 = [1, 2, 3, 4, 5]

In [ ]:
lst1

[1, 2, 3, 4, 5]

In [ ]:
lst2 = [x**2 for x in lst1]
print(lst2)

[1, 4, 9, 16, 25]

In [ ]:
sr = pd.Series(lst2, index=lst1)
sr

1     1
2     4
3     9
4    16
5    25
dtype: int64

In [ ]:
type(sr)

pandas.core.series.Series

In [ ]:
sr

1     1
2     4
3     9
4    16
5    25
dtype: int64

In [ ]:
sr0 = pd.Series(lst2)
sr0

0     1
1     4
2     9
3    16
4    25
dtype: int64

## インデックスを指定して要素にアクセスする

In [ ]:
sr

1     1
2     4
3     9
4    16
5    25
dtype: int64

In [ ]:
sr.at[4]

16

In [ ]:
sr.loc[2:4]

2     4
3     9
4    16
dtype: int64

In [ ]:
sr.at[2] = 999
sr

1      1
2    999
3      9
4     16
5     25
dtype: int64

In [ ]:
sr.loc[2:4] = [555,666,777]
sr

1      1
2    555
3    666
4    777
5     25
dtype: int64

# 数値以外の値をインデックスにする

In [ ]:
words = pd.Series(['りんご','みかん','ぶどう'], index=['apple','orange','grape'])
words

apple     りんご
orange    みかん
grape     ぶどう
dtype: object

In [ ]:
words.at['apple']

'りんご'

In [ ]:
words.apple

'りんご'

In [ ]:
# ドットによるアクセスでは新規要素の追加はできない
words.watermelon = 'すいか'
words   # エラーは出ないが、追加されていない

apple     りんご
orange    みかん
grape     ぶどう
dtype: object

In [ ]:
words.at['watermelon'] = 'すいか'
words

apple         りんご
orange        みかん
grape         ぶどう
watermelon    すいか
dtype: object

In [ ]:
words.grape = '葡萄'  # 書き換えることはできる
words

apple         りんご
orange        みかん
grape          葡萄
watermelon    すいか
dtype: object

## 格納順位を指定して要素にアクセスする

In [ ]:
sr

1      1
2    555
3    666
4    777
5     25
dtype: int64

In [ ]:
sr.iat[3]

777

In [ ]:
sr.iloc[1:4]   # 格納順位で1から3, 4は入らない

2    555
3    666
4    777
dtype: int64

# 演習１

## ステップ１

In [ ]:
import sympy

In [ ]:
p = list(sympy.primerange(1,100))
print(p)

[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

## ステップ２

In [ ]:
idx = list(range(1,len(p)+1))
print(idx)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]

## ステップ３

In [ ]:
sp = pd.Series(p, index=idx)
sp

1      2
2      3
3      5
4      7
5     11
6     13
7     17
8     19
9     23
10    29
11    31
12    37
13    41
14    43
15    47
16    53
17    59
18    61
19    67
20    71
21    73
22    79
23    83
24    89
25    97
dtype: int64

## ステップ４

In [ ]:
sp.at[1]

2

In [ ]:
sp.loc[15:20]

15    47
16    53
17    59
18    61
19    67
20    71
dtype: int64

# スライスの機銃tによるSeriesオブジェクトの要素へのアクセス

## リストの場合

In [ ]:
lst = ['a','b','c','d','e']

In [ ]:
lst[0]

'a'

In [ ]:
sr01 = pd.Series([2,4,6,8,10])
sr01

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [ ]:
sr02 = pd.Series([2,4,6,8,10], index=['a','b','c','d','e'])
sr02

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [ ]:
sr01[0:3]

0    2
1    4
2    6
dtype: int64

In [ ]:
sr02[0:3]

a    2
b    4
c    6
dtype: int64

In [ ]:
sr01.iloc[0:3]

0    2
1    4
2    6
dtype: int64

# 条件指定による要素の抽出

In [ ]:
sr

1      1
2    555
3    666
4    777
5     25
dtype: int64

## 真理値によるマスキング

In [ ]:
msk = [True, True, False, False, True]  # 抽出対象を真理値で

### Seriesに対する条件判定

In [ ]:
sr.iloc[msk]

1      1
2    555
5     25
dtype: int64

In [ ]:
sr < 100

1     True
2    False
3    False
4    False
5     True
dtype: bool

### スライスの中に条件式を記述することができる

In [ ]:
sr[sr < 100]

1     1
5    25
dtype: int64

In [ ]:
sr.iloc[sr < 100]    # iloc, iatには条件式は記述できない

NotImplementedError: iLocation based boolean indexing on an integer type is not available

In [ ]:
sr.loc[sr < 100]

# 重複するインデックスを持つSeriesの扱い

In [ ]:
lst2

In [ ]:
# 重複する要素を持つリスト
ix2 = ['x', 'y', 'y', 'y', 'z']

In [ ]:
sr2 = pd.Series(lst2, index=ix2)
sr2

In [ ]:
sr2.at['y']

In [ ]:
sr2.loc['y']

# Seriesの内部構造

In [ ]:
sr2

## 値の並びをNumPyの配列として取り出す

In [ ]:
sr2.values

In [ ]:
sr2.to_numpy() # を使う方が良い

# Seriesの要素の削除

In [ ]:
sr5 = pd.Series([111,222,333], index=['d1','d2','d3'])
sr5

In [ ]:
sr51 = sr5.drop('d2')
sr51

In [ ]:
sr5

In [ ]:
sr52 = sr5.drop(['d1','d3'])
sr52

## 対象のSeriesの要素を直接的に削除する

In [ ]:
del sr5['d2']
sr5

# Seriesオブジェクトの連結

In [ ]:
srA = pd.Series([11,12,13])
srB = pd.Series([21,22,23])

In [ ]:
srA

In [ ]:
srB

In [ ]:
srAB = pd.concat([srA,srB])
srAB

# インデックスの再設定

## 最も単純な方法（整数インデックス）

In [ ]:
srAB2 = srAB.reset_index(drop=True)
srAB2

## dropを省略した場合

In [ ]:
df1 = srAB.reset_index()   # drop=Trueをつけないと、結果がDataFrameとなる
df1

In [ ]:
type(df1)

## 与えた項目でインデックスを置き換える方法

In [ ]:
srAB

In [ ]:
srAB.index = ['a','b','c','d','e','f']
srAB

# 開始部分/終了部分の取り出し

In [ ]:
sr6 = pd.Series(x**2 for x in range(100))
print(sr6)

In [ ]:
sr6.head(10)

In [ ]:
sr6.tail(10)

# マルチインデックス

## MultiIndexオブジェクトの作成

In [ ]:
midx = pd.MultiIndex.from_tuples([
    ('A','a',1),('A','a',2),
    ('A','b',1),('A','b',2),
    ('B','a',1),('B','a',2),
    ('B','b',1),('B','b',2)
])
midx

MultiIndex([('A', 'a', 1),
            ('A', 'a', 2),
            ('A', 'b', 1),
            ('A', 'b', 2),
            ('B', 'a', 1),
            ('B', 'a', 2),
            ('B', 'b', 1),
            ('B', 'b', 2)],
           )

## マルチインデックスを持つSeriesを作成する

In [ ]:
sr = pd.Series(range(8), index=midx)
sr

A  a  1    0
      2    1
   b  1    2
      2    3
B  a  1    4
      2    5
   b  1    6
      2    7
dtype: int64

## カテゴリ（インデックスレベル）毎にデータを取り出す

In [ ]:
sr.at[('B','a',2)]

5

In [ ]:
sr.at[('A')]

a  1    0
   2    1
b  1    2
   2    3
dtype: int64

In [ ]:
sr.at[('A','b')]

1    2
2    3
dtype: int64

## インデックスレベルを指定した整列

In [ ]:
sr

A  a  1    0
      2    1
   b  1    2
      2    3
B  a  1    4
      2    5
   b  1    6
      2    7
dtype: int64

In [ ]:
sr.sort_index(level=1)

A  a  1    0
      2    1
B  a  1    4
      2    5
A  b  1    2
      2    3
B  b  1    6
      2    7
dtype: int64

In [ ]:
sr.sort_index(level=2)

A  a  1    0
   b  1    2
B  a  1    4
   b  1    6
A  a  2    1
   b  2    3
B  a  2    5
   b  2    7
dtype: int64

## 各インデックスレベルに名前を与える

In [ ]:
midx = pd.MultiIndex.from_tuples([
    ('A','a',1),('A','a',2),
    ('A','b',1),('A','b',2),
    ('B','a',1),('B','a',2),
    ('B','b',1),('B','b',2)
],names=['1st','2nd','3rd'])
midx

MultiIndex([('A', 'a', 1),
            ('A', 'a', 2),
            ('A', 'b', 1),
            ('A', 'b', 2),
            ('B', 'a', 1),
            ('B', 'a', 2),
            ('B', 'b', 1),
            ('B', 'b', 2)],
           names=['1st', '2nd', '3rd'])

In [ ]:
sr = pd.Series(range(8), index=midx)
sr

1st  2nd  3rd
A    a    1      0
          2      1
     b    1      2
          2      3
B    a    1      4
          2      5
     b    1      6
          2      7
dtype: int64

In [ ]:
sr.sort_index(level='3rd')

1st  2nd  3rd
A    a    1      0
     b    1      2
B    a    1      4
     b    1      6
A    a    2      1
     b    2      3
B    a    2      5
     b    2      7
dtype: int64